# Essential Basic Functionality

## initial

In [1]:
import pandas as pd
import numpy as np

In [4]:
index = pd.date_range('1/1/2019',periods=8);

In [7]:
print(index)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08'],
              dtype='datetime64[ns]', freq='D')

In [9]:
s = pd.Series(np.random.rand(8),index=index)

In [10]:
s

2019-01-01    0.317667
2019-01-02    0.297489
2019-01-03    0.995509
2019-01-04    0.022077
2019-01-05    0.508885
2019-01-06    0.834586
2019-01-07    0.154597
2019-01-08    0.445539
Freq: D, dtype: float64

In [12]:
df = pd.DataFrame(np.random.randn(8,3),index=index,columns=['A','B','C'])

In [13]:
df

                   A         B         C
2019-01-01 -2.029053 -1.711115 -0.441056
2019-01-02 -0.435344  0.089230  1.894934
2019-01-03  0.502085 -0.680719 -0.393455
2019-01-04  1.950343  0.210752 -0.653792
2019-01-05  0.207327 -0.335393 -0.423645
2019-01-06 -0.982274  0.873818 -0.714491
2019-01-07 -1.570789 -1.815986  1.410653
2019-01-08 -0.847655  0.531241  1.164773

## Head and Tail

In [14]:
df.head()

                   A         B         C
2019-01-01 -2.029053 -1.711115 -0.441056
2019-01-02 -0.435344  0.089230  1.894934
2019-01-03  0.502085 -0.680719 -0.393455
2019-01-04  1.950343  0.210752 -0.653792
2019-01-05  0.207327 -0.335393 -0.423645

In [15]:
df.tail()

                   A         B         C
2019-01-04  1.950343  0.210752 -0.653792
2019-01-05  0.207327 -0.335393 -0.423645
2019-01-06 -0.982274  0.873818 -0.714491
2019-01-07 -1.570789 -1.815986  1.410653
2019-01-08 -0.847655  0.531241  1.164773

In [16]:
df.head(2)

                   A         B         C
2019-01-01 -2.029053 -1.711115 -0.441056
2019-01-02 -0.435344  0.089230  1.894934

## Attributes and the raw ndarrays

**shape  
Series: index  
DataFrame: index, columns 
values**

In [18]:
s.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [24]:
df.columns = [x.lower() for x in df.columns]

In [26]:
df

                   a         b         c
2019-01-01 -2.029053 -1.711115 -0.441056
2019-01-02 -0.435344  0.089230  1.894934
2019-01-03  0.502085 -0.680719 -0.393455
2019-01-04  1.950343  0.210752 -0.653792
2019-01-05  0.207327 -0.335393 -0.423645
2019-01-06 -0.982274  0.873818 -0.714491
2019-01-07 -1.570789 -1.815986  1.410653
2019-01-08 -0.847655  0.531241  1.164773

In [27]:
df.values # 返回np.ndarrays

array([[-2.02905298, -1.71111537, -0.44105556],
       [-0.43534416,  0.08923016,  1.89493377],
       [ 0.50208511, -0.68071881, -0.39345524],
       [ 1.95034303,  0.21075223, -0.65379154],
       [ 0.20732718, -0.33539291, -0.42364528],
       [-0.98227399,  0.87381826, -0.71449119],
       [-1.57078899, -1.81598616,  1.41065252],
       [-0.84765541,  0.53124146,  1.16477339]])

## Accelerated operations

额外的两个库，加快计算，numexpr bottleneck  
pd.set_option('compute.use_bottleneck', False)  
pd.set_option('compute.use_numexpr', False)

## Flexible binary operations

With binary operations between pandas data structures, there are two key points of interest:

- Broadcasting behavior between higher- (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.  
- Missing data in computations.

We will demonstrate how to manage these issues independently, though they can be handled simultaneously.

**add,sub,mul,div,radd,rsub**

### Matching or broadcasting behavior

In [64]:
df = pd.DataFrame({'one':pd.Series(np.random.randn(3),index=['a','b','c']),
                  'two':pd.Series(np.random.randn(4),index=['a','b','c','d']),
                  'three':pd.Series(np.random.randn(3),index=['b','c','d'])})

In [31]:
df

        one       two     three
a  0.863138  0.218775       NaN
b  0.533974 -1.104309  0.487657
c -0.224219  0.706047  1.579876
d       NaN  2.939465  0.163818

In [34]:
row = df.iloc[1];row

one      0.533974
two     -1.104309
three    0.487657
Name: b, dtype: float64

In [37]:
column = df['two']

In [38]:
column

a    0.218775
b   -1.104309
c    0.706047
d    2.939465
Name: two, dtype: float64

In [39]:
df.sub(row,axis='columns')

        one       two     three
a  0.329164  1.323084       NaN
b  0.000000  0.000000  0.000000
c -0.758193  1.810356  1.092219
d       NaN  4.043774 -0.323838

In [40]:
df.add(column,axis='index')

        one       two     three
a  1.081913  0.437551       NaN
b -0.570335 -2.208617 -0.616652
c  0.481828  1.412094  2.285923
d       NaN  5.878931  3.103283

In [41]:
df.sub(column,axis='index')

        one  two     three
a  0.644363  0.0       NaN
b  1.638283  0.0  1.591965
c -0.930267  0.0  0.873829
d       NaN  0.0 -2.775647

In [42]:
df.add(row,axis=1)

        one       two     three
a  1.397112 -0.885533       NaN
b  1.067948 -2.208617  0.975313
c  0.309755 -0.398261  2.067532
d       NaN  1.835157  0.651475

In [46]:
dfmi = df.copy()
df

        one       two     three
a  0.863138  0.218775       NaN
b  0.533974 -1.104309  0.487657
c -0.224219  0.706047  1.579876
d       NaN  2.939465  0.163818

In [44]:
dfmi.index = pd.MultiIndex.from_tuples([(1,'a'),(1,'b'),(1,'c'),(2,'a')],
                                      names=['first','second'])

In [45]:
dfmi

                   one       two     three
first second
1     a       0.863138  0.218775       NaN
      b       0.533974 -1.104309  0.487657
      c      -0.224219  0.706047  1.579876
2     a            NaN  2.939465  0.163818

In [48]:
dfmi.sub(column,axis=0,level='second')

        one  two     three
a  0.644363  0.0       NaN
b  1.638283  0.0  1.591965
c -0.930267  0.0  0.873829
d       NaN  0.0 -2.775647

**Series: divmod**  
element-wise or not

In [49]:
s = pd.Series(np.random.randn(10))

In [51]:
divmod(s,3)

(0    0.0
 1   -1.0
 2    0.0
 3    0.0
 4   -1.0
 5    0.0
 6   -1.0
 7    0.0
 8   -1.0
 9    0.0
 dtype: float64, 0    0.180264
 1    2.722570
 2    0.360812
 3    0.239803
 4    2.144965
 5    1.106404
 6    1.779003
 7    1.346648
 8    2.366028
 9    1.054167
 dtype: float64)

### Missing data / operations with fill values

**using fill_value parameter**

In [65]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [66]:
df2 = df.copy()

In [67]:
df2.loc['a','three'] = 1

In [68]:
df2

        one       two     three
a  0.365221  1.311968  1.000000
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [69]:
df.add(df2)

        one       two     three
a  0.730442  2.623936       NaN
b  4.482685  0.617029  3.086722
c -4.270868 -2.684210 -0.133849
d       NaN -0.961227  2.783875

In [70]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [71]:
df.add(df2,fill_value=0)

        one       two     three
a  0.730442  2.623936  1.000000
b  4.482685  0.617029  3.086722
c -4.270868 -2.684210 -0.133849
d       NaN -0.961227  2.783875

### flexible Comparisons

**eq: ==**  
**ne: <=**  
**lt: <**  
**gt: >**  
**ge: >=**

In [73]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [74]:
df2

        one       two     three
a  0.365221  1.311968  1.000000
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [75]:
df.eq(df2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [76]:
df2.iloc[0,0] = 10

In [77]:
df.ne(df2)

     one    two  three
a   True  False   True
b  False  False  False
c  False  False  False
d   True  False  False

### Boolean Reductions

**empty**  
**any()**  
**all()**  
**bool()**

In [79]:
df.empty

False

In [81]:
(df>0).all()

one      False
two      False
three    False
dtype: bool

In [84]:
df.all()

one      True
two      True
three    True
dtype: bool

In [85]:
(df>0).any()

one      True
two      True
three    True
dtype: bool

### Comparing if objects are equivalent

**df1.euals(df2)**

In [87]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [90]:
(df + df == df*2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [91]:
(df+df == df*2).all()

one      False
two       True
three    False
dtype: bool

In [92]:
(df+df).equals(2*df)

True

### Comparing **array-like** objects

In [97]:
pd.Series(['foo','bar','baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [98]:
pd.Index(['foo','bar','baz']) == 'foo'

array([ True, False, False])

In [99]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

In [100]:
pd.Series(['foo', 'bar', 'baz']) == np.array(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

### Combining Overlapping data sets

**combine_first()**

In [102]:
 df1 = pd.DataFrame({'A' : [1., np.nan, 3., 5., np.nan],
   ....:                     'B' : [np.nan, 2., 3., np.nan, 6.]})

In [103]:
df2 = pd.DataFrame({'A' : [5., 2., 4., np.nan, 3., 7.],
   ....:                     'B' : [np.nan, np.nan, 3., 4., 6., 8.]})

In [104]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

### General DataFrame Combine

df.combine(df2,combiner)

In [105]:
combiner = lambda x,y : np.where(pd.isna(x),y,x) # np.where(condition,a,b)条件表达式
df1.combine(df2,combiner)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

## Descriptive statistics

In [106]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [107]:
df.mean(0)

one      0.157043
two     -0.050559
three    0.956125
dtype: float64

In [108]:
df.mean(1)

a    0.838594
b    1.364406
c   -1.181488
d    0.455662
dtype: float64

In [109]:
df.mean() # 默认是比较行

one      0.157043
two     -0.050559
three    0.956125
dtype: float64

In [110]:
df.sum() # skipna=True

one      0.471129
two     -0.202236
three    2.868374
dtype: float64

In [112]:
df.sum(axis=1,skipna=False)

a         NaN
b    4.093218
c   -3.544463
d         NaN
dtype: float64

In [113]:
df.count()

one      3
two      4
three    3
dtype: int64

In [115]:
df.mad()

one      1.528318
two      0.860800
three    0.682033
dtype: float64

In [116]:
df.median()

one      0.365221
two     -0.086049
three    1.391937
dtype: float64

In [117]:
df.mode()

        one       two     three
0 -2.135434 -1.342105 -0.066924
1  0.365221 -0.480613  1.391937
2  2.241342  0.308514  1.543361
3       NaN  1.311968       NaN

In [119]:
df.std()

one      2.195802
two      1.131143
three    0.889216
dtype: float64

In [120]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [127]:
df.sub(df.mean(1),axis=0).div(df.std(1),axis=0)

        one       two     three
a -0.707107  0.707107       NaN
b  0.895965 -1.078803  0.182838
c -0.914121 -0.153912  1.068033
d       NaN -0.707107  0.707107

In [126]:
df.sub(df.mean(),axis=1).div(df.std(),axis=1)

        one       two     three
a  0.094807  1.204558       NaN
b  0.949220  0.317443  0.660398
c -1.044027 -1.141806 -1.150507
d       NaN -0.380195  0.490109

In [129]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [130]:
df.cumsum()

        one       two     three
a  0.365221  1.311968       NaN
b  2.606563  1.620482  1.543361
c  0.471129  0.278377  1.476437
d       NaN -0.202236  2.868374

In [131]:
df.cumprod()

        one       two     three
a  0.365221  1.311968       NaN
b  0.818585  0.404761  1.543361
c -1.748035 -0.543232 -0.103288
d       NaN  0.261084 -0.143771

In [132]:
df.prod()

one     -1.748035
two      0.261084
three   -0.143771
dtype: float64

In [134]:
np.mean(df['one'])

0.15704312213418184

In [136]:
np.sum(df['one'].values)

nan

**Series.unique()**  
**Series.nunique()**

In [137]:
s = pd.Series(np.arange(500))

In [139]:
s.nunique()

500

### Summarizing data：describe

In [141]:
series = pd.Series(np.random.randn(1000))

In [142]:
series[::2] = np.nan# 跳步计算

In [143]:
series.describe()

count    500.000000
mean       0.056523
std        0.968750
min       -3.157860
25%       -0.561365
50%        0.091892
75%        0.719061
max        3.444375
dtype: float64

In [155]:
frame = pd.DataFrame(np.random.randn(1000, 5), columns=['a', 'b', 'c', 'd', 'e'])

In [156]:
frame

            a         b         c         d         e
0   -1.523787  0.006095 -1.637804  0.783473  0.456400
1    0.013988  1.534118 -0.170779  1.936119 -0.908024
2    0.320182 -0.258660  0.361726  0.357721  2.179598
3    0.367832 -1.215618 -0.627538 -2.220948 -1.189116
4    0.032363  0.740127  0.392699 -0.558319 -0.079726
5   -0.411063  0.821935 -0.648872 -1.600485  0.712059
6   -1.299705  1.462500  2.309391  0.467033  0.157627
7   -1.038715  0.842915  1.004454  1.260574 -0.622513
8    1.718996  0.535217  0.169180 -0.856883 -0.684507
9    0.731398 -0.109982 -0.155836  0.054583 -0.208543
10   1.254261  0.920553  1.155788 -0.219432  0.368703
11   0.500749  0.295865 -0.424909 -0.059970 -0.190672
12   0.943805 -0.034059  0.888251 -1.639089 -0.022951
13   1.206171  0.880169 -0.500010 -1.203043 -0.100705
14  -0.613444  0.117370  0.333067  0.585606 -0.031468
15  -1.516703  1.633332 -2.214844  0.824878  0.105484
16  -0.462000  0.505611 -0.441683 -0.213107 -1.205638
17   0.453098  0.555694 -0.318419  2.468690 -0.234380
18   1.045312 -0.707901  1.373032 -0.771768 -0.762261
19  -0.075266  0.634284 -0.355464 -0.172556  1.057177
20  -0.305565 -0.019605  1.290212  1.184707 -1.092757
21   0.413741  0.509474  0.908574  0.138457 -0.021307
22   0.320048 -0.008209 -0.489598 -2.077973  0.940880
23   2.598320  0.398546 -1.229597  1.511808 -0.861561
24   0.800834  0.636936  0.136359 -0.672194 -0.326924
25   0.740866  0.183771 -0.132655  1.367725 -1.106914
26  -2.127654 -0.169165 -2.164130  0.849776 -0.727730
27  -1.103740  0.484755 -2.194192  0.128756  1.041930
28   0.804852 -0.336421 -1.816636 -0.581235 -0.860180
29  -0.047111  0.971652  0.420622 -1.211770  0.254502
..        ...       ...       ...       ...       ...
970 -0.995815 -0.221535  0.625672 -0.712353 -1.168016
971  1.203693 -1.071530  0.542174  0.160334 -0.209958
972  0.245227  1.093325  0.653147  0.834446  0.337215
973  1.455154 -0.244148  0.030529 -0.388406  0.287454
974 -0.377569  0.423540  1.079389 -1.067548  0.580182
975  0.769962  1.022027  2.868771  0.405048  0.680094
976  0.551149  0.543122 -0.737821  1.102678 -1.152378
977 -1.379326 -1.067682  0.063847 -0.997020 -0.071439
978  0.359766 -1.221753 -1.144707  1.978049 -1.197555
979 -1.480481 -0.239620  0.532666  0.267851 -0.356786
980 -1.195949  0.370627  2.561271  0.746202 -0.287533
981 -1.194603 -0.375261 -0.735413  0.661832 -0.656655
982 -1.363957  0.755878  1.263767  0.091327 -0.723520
983 -0.514215 -0.288495  1.294299 -0.838336  0.665479
984 -0.112095  0.627168 -0.689463  1.186009 -0.066193
985  1.333199 -0.269249 -0.881673 -0.733297 -0.288580
986 -1.072110  0.079539 -1.002762 -0.623549  0.298798
987 -0.064767 -0.396090 -0.063125 -0.657258 -0.036232
988 -1.641483  0.892969  0.676914 -0.760923  0.497571
989  1.007576 -0.584309 -0.320178  0.085407  1.502335
990  1.229539  0.162034 -0.361630  0.233607  0.524834
991  0.721259  0.826271  1.861652  0.137495 -0.787301
992 -1.684429 -0.488986  0.084620  0.425463  0.385238
993 -2.328330  0.310655 -0.204390  0.892730  0.789619
994  1.359944  0.061202  0.092021  0.219335 -0.126595
995 -0.636355  1.661233  0.249846  0.729405 -0.154715
996 -0.885454  0.377080 -0.077427  0.208050  1.324801
997 -0.245951 -0.764403 -0.537632  1.252029 -0.119745
998  0.130793 -0.135029  1.477683 -0.366663 -0.373301
999  0.641256 -0.110718  0.452099 -0.728516  0.904090

[1000 rows x 5 columns]

In [157]:
frame.iloc[::2] = np.nan# 行跳步

In [158]:
frame

            a         b         c         d         e
0         NaN       NaN       NaN       NaN       NaN
1    0.013988  1.534118 -0.170779  1.936119 -0.908024
2         NaN       NaN       NaN       NaN       NaN
3    0.367832 -1.215618 -0.627538 -2.220948 -1.189116
4         NaN       NaN       NaN       NaN       NaN
5   -0.411063  0.821935 -0.648872 -1.600485  0.712059
6         NaN       NaN       NaN       NaN       NaN
7   -1.038715  0.842915  1.004454  1.260574 -0.622513
8         NaN       NaN       NaN       NaN       NaN
9    0.731398 -0.109982 -0.155836  0.054583 -0.208543
10        NaN       NaN       NaN       NaN       NaN
11   0.500749  0.295865 -0.424909 -0.059970 -0.190672
12        NaN       NaN       NaN       NaN       NaN
13   1.206171  0.880169 -0.500010 -1.203043 -0.100705
14        NaN       NaN       NaN       NaN       NaN
15  -1.516703  1.633332 -2.214844  0.824878  0.105484
16        NaN       NaN       NaN       NaN       NaN
17   0.453098  0.555694 -0.318419  2.468690 -0.234380
18        NaN       NaN       NaN       NaN       NaN
19  -0.075266  0.634284 -0.355464 -0.172556  1.057177
20        NaN       NaN       NaN       NaN       NaN
21   0.413741  0.509474  0.908574  0.138457 -0.021307
22        NaN       NaN       NaN       NaN       NaN
23   2.598320  0.398546 -1.229597  1.511808 -0.861561
24        NaN       NaN       NaN       NaN       NaN
25   0.740866  0.183771 -0.132655  1.367725 -1.106914
26        NaN       NaN       NaN       NaN       NaN
27  -1.103740  0.484755 -2.194192  0.128756  1.041930
28        NaN       NaN       NaN       NaN       NaN
29  -0.047111  0.971652  0.420622 -1.211770  0.254502
..        ...       ...       ...       ...       ...
970       NaN       NaN       NaN       NaN       NaN
971  1.203693 -1.071530  0.542174  0.160334 -0.209958
972       NaN       NaN       NaN       NaN       NaN
973  1.455154 -0.244148  0.030529 -0.388406  0.287454
974       NaN       NaN       NaN       NaN       NaN
975  0.769962  1.022027  2.868771  0.405048  0.680094
976       NaN       NaN       NaN       NaN       NaN
977 -1.379326 -1.067682  0.063847 -0.997020 -0.071439
978       NaN       NaN       NaN       NaN       NaN
979 -1.480481 -0.239620  0.532666  0.267851 -0.356786
980       NaN       NaN       NaN       NaN       NaN
981 -1.194603 -0.375261 -0.735413  0.661832 -0.656655
982       NaN       NaN       NaN       NaN       NaN
983 -0.514215 -0.288495  1.294299 -0.838336  0.665479
984       NaN       NaN       NaN       NaN       NaN
985  1.333199 -0.269249 -0.881673 -0.733297 -0.288580
986       NaN       NaN       NaN       NaN       NaN
987 -0.064767 -0.396090 -0.063125 -0.657258 -0.036232
988       NaN       NaN       NaN       NaN       NaN
989  1.007576 -0.584309 -0.320178  0.085407  1.502335
990       NaN       NaN       NaN       NaN       NaN
991  0.721259  0.826271  1.861652  0.137495 -0.787301
992       NaN       NaN       NaN       NaN       NaN
993 -2.328330  0.310655 -0.204390  0.892730  0.789619
994       NaN       NaN       NaN       NaN       NaN
995 -0.636355  1.661233  0.249846  0.729405 -0.154715
996       NaN       NaN       NaN       NaN       NaN
997 -0.245951 -0.764403 -0.537632  1.252029 -0.119745
998       NaN       NaN       NaN       NaN       NaN
999  0.641256 -0.110718  0.452099 -0.728516  0.904090

[1000 rows x 5 columns]

In [161]:
frame.iloc[:,::2] = np.nan # 列跳步

In [162]:
frame

      a         b   c         d   e
0   NaN       NaN NaN       NaN NaN
1   NaN  1.534118 NaN  1.936119 NaN
2   NaN       NaN NaN       NaN NaN
3   NaN -1.215618 NaN -2.220948 NaN
4   NaN       NaN NaN       NaN NaN
5   NaN  0.821935 NaN -1.600485 NaN
6   NaN       NaN NaN       NaN NaN
7   NaN  0.842915 NaN  1.260574 NaN
8   NaN       NaN NaN       NaN NaN
9   NaN -0.109982 NaN  0.054583 NaN
10  NaN       NaN NaN       NaN NaN
11  NaN  0.295865 NaN -0.059970 NaN
12  NaN       NaN NaN       NaN NaN
13  NaN  0.880169 NaN -1.203043 NaN
14  NaN       NaN NaN       NaN NaN
15  NaN  1.633332 NaN  0.824878 NaN
16  NaN       NaN NaN       NaN NaN
17  NaN  0.555694 NaN  2.468690 NaN
18  NaN       NaN NaN       NaN NaN
19  NaN  0.634284 NaN -0.172556 NaN
20  NaN       NaN NaN       NaN NaN
21  NaN  0.509474 NaN  0.138457 NaN
22  NaN       NaN NaN       NaN NaN
23  NaN  0.398546 NaN  1.511808 NaN
24  NaN       NaN NaN       NaN NaN
25  NaN  0.183771 NaN  1.367725 NaN
26  NaN       NaN NaN       NaN NaN
27  NaN  0.484755 NaN  0.128756 NaN
28  NaN       NaN NaN       NaN NaN
29  NaN  0.971652 NaN -1.211770 NaN
..   ..       ...  ..       ...  ..
970 NaN       NaN NaN       NaN NaN
971 NaN -1.071530 NaN  0.160334 NaN
972 NaN       NaN NaN       NaN NaN
973 NaN -0.244148 NaN -0.388406 NaN
974 NaN       NaN NaN       NaN NaN
975 NaN  1.022027 NaN  0.405048 NaN
976 NaN       NaN NaN       NaN NaN
977 NaN -1.067682 NaN -0.997020 NaN
978 NaN       NaN NaN       NaN NaN
979 NaN -0.239620 NaN  0.267851 NaN
980 NaN       NaN NaN       NaN NaN
981 NaN -0.375261 NaN  0.661832 NaN
982 NaN       NaN NaN       NaN NaN
983 NaN -0.288495 NaN -0.838336 NaN
984 NaN       NaN NaN       NaN NaN
985 NaN -0.269249 NaN -0.733297 NaN
986 NaN       NaN NaN       NaN NaN
987 NaN -0.396090 NaN -0.657258 NaN
988 NaN       NaN NaN       NaN NaN
989 NaN -0.584309 NaN  0.085407 NaN
990 NaN       NaN NaN       NaN NaN
991 NaN  0.826271 NaN  0.137495 NaN
992 NaN       NaN NaN       NaN NaN
993 NaN  0.310655 NaN  0.892730 NaN
994 NaN       NaN NaN       NaN NaN
995 NaN  1.661233 NaN  0.729405 NaN
996 NaN       NaN NaN       NaN NaN
997 NaN -0.764403 NaN  1.252029 NaN
998 NaN       NaN NaN       NaN NaN
999 NaN -0.110718 NaN -0.728516 NaN

[1000 rows x 5 columns]

In [163]:
frame.describe()

         a           b    c           d    e
count  0.0  500.000000  0.0  500.000000  0.0
mean   NaN   -0.038911  NaN   -0.013078  NaN
std    NaN    1.000827  NaN    1.016236  NaN
min    NaN   -2.830401  NaN   -2.812139  NaN
25%    NaN   -0.736055  NaN   -0.655201  NaN
50%    NaN   -0.058612  NaN    0.008740  NaN
75%    NaN    0.674879  NaN    0.712434  NaN
max    NaN    2.643937  NaN    3.095411  NaN

In [164]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])

In [165]:
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [167]:
frame = pd.DataFrame({'a': ['Yes', 'Yes', 'No', 'No'], 'b': range(4)})

In [168]:
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [170]:
frame.describe(include=['object'])

          a
count     4
unique    2
top     Yes
freq      2

In [171]:
frame.describe(include=['number'])

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [172]:
frame.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top     Yes       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

### Index of Min/Max Values

In [173]:
s1 = pd.Series(np.random.randn(5))

In [174]:
s1.idxmax(),s1.idxmin()

(3, 4)

In [175]:
df1 = pd.DataFrame(np.random.randn(5,3), columns=['A','B','C'])

In [176]:
df1.idxmax(1)

0    A
1    A
2    C
3    A
4    A
dtype: object

In [177]:
df1.idxmin(0)

A    2
B    2
C    0
dtype: int64

In [178]:
df3 = pd.DataFrame([2, 1, 1, 3, np.nan], columns=['A'], index=list('edcba'))

In [179]:
df3['A'].idxmin()

'd'

### Value counts(histogramming)/Mode

In [180]:
data = np.random.randint(0, 7, size=50)

In [181]:
s = pd.Series(data)

In [182]:
s.value_counts()

0    11
1    10
3     7
6     6
5     6
4     6
2     4
dtype: int64

In [183]:
pd.value_counts(data)

0    11
1    10
3     7
6     6
5     6
4     6
2     4
dtype: int64

In [184]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),
   .....:                     "B": np.random.randint(-10, 15, size=50)})

In [185]:
df5.mode()

   A   B
0  0  10

### Discretization and quantiling

In [186]:
arr = np.random.randn(20)

In [187]:
arr

array([-0.22896781,  1.42806776,  1.2221146 , -0.29686473,  0.40325903,
       -0.82779676, -1.47491117,  0.86594048, -0.14675593, -1.16908258,
        1.68357886, -1.55741509, -0.5546585 , -1.36534314, -0.00573163,
        1.47785958,  0.39225899, -0.93736159, -0.43367463,  1.00507517])

In [188]:
arr.max()

1.6835788639059295

In [189]:
factor = pd.cut(arr,4) # 返回数据所属的区间

In [190]:
factor

[(-0.747, 0.0631], (0.873, 1.684], (0.873, 1.684], (-0.747, 0.0631], (0.0631, 0.873], ..., (0.873, 1.684], (0.0631, 0.873], (-1.561, -0.747], (-0.747, 0.0631], (0.873, 1.684]]
Length: 20
Categories (4, interval[float64]): [(-1.561, -0.747] < (-0.747, 0.0631] < (0.0631, 0.873] < (0.873, 1.684]]

## Function application

To apply your own or another library’s functions to pandas objects, you should be aware of the three methods below. The appropriate method to use depends on whether your function expects to operate on an entire DataFrame or Series, row- or column-wise, or elementwise.

- Tablewise Function Application: pipe()
- Row or Column-wise Function Application: apply()
- Aggregation API: agg() and transform()
- Applying Elementwise Functions: applymap()

### Tablewise Function

### Row or Column-wiseFuynction Application

In [192]:
df

        one       two     three
a  0.365221  1.311968       NaN
b  2.241342  0.308514  1.543361
c -2.135434 -1.342105 -0.066924
d       NaN -0.480613  1.391937

In [194]:
df.apply(np.mean)

one      0.157043
two     -0.050559
three    0.956125
dtype: float64

In [195]:
df.apply(lambda x:x.max()-x.min())

one      4.376776
two      2.654073
three    1.610286
dtype: float64

In [197]:
df.apply(lambda x:x.max()-x.min(),axis=1)

a    0.946747
b    1.932828
c    2.068510
d    1.872551
dtype: float64

In [198]:
df.apply(np.exp)

        one       two     three
a  1.440832  3.713474       NaN
b  9.405949  1.361401  4.680295
c  0.118193  0.261295  0.935266
d       NaN  0.618404  4.022636

In [199]:
df.apply(np.cumsum)

        one       two     three
a  0.365221  1.311968       NaN
b  2.606563  1.620482  1.543361
c  0.471129  0.278377  1.476437
d       NaN -0.202236  2.868374

In [202]:
df.apply(np.max,axis=1)

a    1.311968
b    2.241342
c   -0.066924
d    1.391937
dtype: float64

In [204]:
tsdf = pd.DataFrame(np.random.randn(1000, 3), columns=['A', 'B', 'C'],
   .....:                     index=pd.date_range('1/1/2000', periods=1000))

In [205]:
tsdf.apply(lambda x: x.idxmax())

A   2000-06-13
B   2000-03-21
C   2001-02-10
dtype: datetime64[ns]

In [207]:
tsdf.apply(pd.Series.idxmax) # 可以这样找到DF与series的函数

A   2000-06-13
B   2000-03-21
C   2001-02-10
dtype: datetime64[ns]

### Aggregation API

#### Aggerating with multiple functions

In [208]:
tsdf = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],
   .....:                     index=pd.date_range('1/1/2000', periods=10))

In [209]:
tsdf.agg(['sum'])

            A         B         C
sum -1.379012 -2.197102  2.466402

In [210]:
tsdf.agg(['sum', 'mean'])

             A         B         C
sum  -1.379012 -2.197102  2.466402
mean -0.137901 -0.219710  0.246640

In [211]:
tsdf.A.agg(['sum', lambda x: x.mean()])

sum        -1.379012
<lambda>   -0.137901
Name: A, dtype: float64

#### Aggerating with a dict

#### Mixed Dtypes

#### Custom describe

### Transform API

#### Transform with multiple functions

#### Trandform wirh a dict

### Applying Elementwise Functions

### Applying wirh a panel

## Reindexing and altering labels

### Reindexing to align with another object

### Aligning objects with each other with align

### Filling while reindexing

### Limits on filling while reindexing

### Dropping labels from an axis

### Renaming / mapping labels